## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/5abb4056-3693-4b4f-b525-ce481f6b01d1).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpv3rs2zpr/plan`

```diff

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.mysql.module.mysql_deployment.akash_deployment.service has changed
!   resource "akash_deployment" "service" {
        id                            = "19217103:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       services                      = [
!           {
!               available          = 1 -> 0
!               available_replicas = 1 -> 0
                name               = "mysql-dev-50a6738c"
!               ready_replicas     = 0 -> 1
                # (6 unchanged attributes hidden)
            },
        ]
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # cloudflare_dns_record.renterd will be created
+   resource "cloudflare_dns_record" "renterd" {
+       comment_modified_on = (known after apply)
+       content             = "mjsn7f9vidclfagjtbnqk04p34.ingress.ny-01.node.infra.lumeweb.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "renterd.test-node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

  # cloudflare_dns_record.renterd_s3 will be created
+   resource "cloudflare_dns_record" "renterd_s3" {
+       comment_modified_on = (known after apply)
+       content             = "mjsn7f9vidclfagjtbnqk04p34.ingress.ny-01.node.infra.lumeweb.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "s3.renterd.test-node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
